Revit 2027 API
WorksetPreview.UniqueId Property
 UniqueId of the workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid UniqueId { get; }
Public ReadOnly Property UniqueId As Guid
	Get
public:
property Guid UniqueId {
	Guid get ();
}
member UniqueId : Guid with get
Property Value
Guid
Remarks
 Stable identifier for a workset, UniqueId will not change while synchronizing with central.
See Also
Reference
WorksetPreview Class
Autodesk.Revit.DB Namespace